README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-11-30 Чт 19:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Git Hooks Collection</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Roman Zayrullin" />
</head>
<body>
<div id="content">
<h1 class="title">Git Hooks Collection</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga47c682">1. Проверка на брейкпоинты и временный код.</a></li>
<li><a href="#org2655afb">2. Контроль тестирования\сборки</a>
<ul>
<li><a href="#org624dfac">2.1. Интерактивная сборка</a></li>
</ul>
</li>
<li><a href="#orgaaebf4f">3. Вставка имени ветки в сообщение коммита</a></li>
<li><a href="#orga135ada">4. Настройка и добавление хуков в репы</a></li>
</ul>
</div>
</div>
<p>
Хуки, облегчающие трудовыебудни.
</p>
<div class="org-src-container">
<pre class="src src-shell" id="orga192657"><span style="color: #ff69b4;">GETTEXT</span>=<span style="color: #61CE3C;">'gettext "kr-githooks"'</span>
</pre>
</div>

<div id="outline-container-orga47c682" class="outline-2">
<h2 id="orga47c682"><span class="section-number-2">1</span> Проверка на брейкпоинты и временный код.</h2>
<div class="outline-text-2" id="text-1">
<p>
Помечать временный код &#x2013; хорошее решение. Помечайте временный
код. Называйте специфично временные переменные, или добавляйте
соответствующий комментарий. Я, например, для помечания временного кода
использую слово <code>Petuch</code> в данных, комментариях или как имя
временной переменной, используемой для отладки.
Хук отлавливает помеченный временный код, забытые бряки гнутых
дебаггеров и прерывает коммит при их нахождении.
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org7552bd0"><span style="color: #ff69b4;">REJECT_MESSAGE</span>=$($<span style="color: #ff69b4;">GETTEXT</span> <span style="color: #61CE3C;">"COMMIT REJECTED: commit contains code with break points. Please remove before commiting."</span>)
<span style="color: #ff69b4;">CLEAR_STATUS_MESSAGE</span>=$($<span style="color: #ff69b4;">GETTEXT</span> <span style="color: #61CE3C;">"Code contains no break points"</span>)
<span style="color: #ff69b4;">tc_check</span>=$(<span style="color: #fa8072;">git</span> grep -i <span style="color: #61CE3C;">"$REGXP_TC"</span> -- <span style="color: #61CE3C;">"$F_MASK"</span>)
<span style="color: #4c83ff;">if</span> [ ${#<span style="color: #ff69b4;">tc_check</span>} -gt 0 ]
<span style="color: #4c83ff;">then</span>
        <span style="color: #4c83ff;">echo</span> -e $<span style="color: #ff69b4;">tc_check</span> <span style="color: #61CE3C;">"\e[31m$REJECT_MESSAGE\e[0m"</span> | cowsay -f dragon
        <span style="color: #4c83ff;">exit</span> 1
<span style="color: #4c83ff;">else</span>
        <span style="color: #4c83ff;">echo</span> -e $<span style="color: #ff69b4;">tc_check</span> <span style="color: #61CE3C;">"\e[36m$CLEAR_STATUS_MESSAGE\e[0m"</span> | cowsay
<span style="color: #4c83ff;">fi</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2655afb" class="outline-2">
<h2 id="org2655afb"><span class="section-number-2">2</span> Контроль тестирования\сборки</h2>
<div class="outline-text-2" id="text-2">
<p>
Перед коммитов выполняется команда на контроль качества. Прогон
тестов, сборка.
</p>

<div class="org-src-container">
<pre class="src src-shell" id="org617b7e1"><span style="color: #ff69b4;">TEST_PASSED</span>=$($<span style="color: #ff69b4;">GETTEXT</span> <span style="color: #61CE3C;">"\e[36mAll Test Passed\e[0m"</span>)
<span style="color: #ff69b4;">TEST_FAILED</span>=$($<span style="color: #ff69b4;">GETTEXT</span> <span style="color: #61CE3C;">"\e[31mCOMMIT REJECTED: Test's failed!\e[0m"</span>)
$<span style="color: #ff69b4;">QCONTROL_COMMAND</span>
<span style="color: #ff69b4;">RESULT</span>=$<span style="color: #ff69b4;">?</span>
<span style="color: #4c83ff;">if</span> [ $<span style="color: #ff69b4;">RESULT</span> -ne 0 ]
<span style="color: #4c83ff;">then</span>
    <span style="color: #4c83ff;">echo</span> -e $<span style="color: #ff69b4;">TEST_FAILED</span> | cowsay -f dragon
    <span style="color: #4c83ff;">exit</span> 1
<span style="color: #4c83ff;">else</span>
    <span style="color: #4c83ff;">echo</span> -e $<span style="color: #ff69b4;">TEST_PASSED</span> | cowsay 
<span style="color: #4c83ff;">fi</span>
</pre>
</div>
</div>

<div id="outline-container-org624dfac" class="outline-3">
<h3 id="org624dfac"><span class="section-number-3">2.1</span> Интерактивная сборка</h3>
<div class="outline-text-3" id="text-2-1">
<p>
В блок кода ниже вставить имена чанков в noweb-синтаксисе и
выполнить <code>org-babel-tangle</code> (по-умолчанию <code>C-c C-v t</code>)
</p>
<div class="org-src-container">
<pre class="src src-shell" id="org5d9dc26"><span style="color: #8B8989; font-style: italic;">#</span><span style="color: #8B8989; font-style: italic;">!/bin/</span><span style="color: #4c83ff;">bash</span>
{{{l10n}}}
<span style="color: #ff69b4;">REGXP_TC</span>=<span style="color: #61CE3C;">"; Tracer()()\|.set_trace()\|petuch"</span>
<span style="color: #ff69b4;">F_MASK</span>=<span style="color: #61CE3C;">"*.py"</span>
<span style="color: #ff69b4;">QCONTROL_COMMAND</span>=<span style="color: #61CE3C;">"./manage.py test"</span>
{{{&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1085;&#1072; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1077; &#1085;&#1077;&#1078;&#1077;&#1083;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;\&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1072;}}}
{{{&#1090;&#1077;&#1089;&#1090;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1086;&#1084;&#1084;&#1080;&#1090;&#1086;&#1084;}}}
<span style="color: #4c83ff;">exit</span> 0
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaaebf4f" class="outline-2">
<h2 id="orgaaebf4f"><span class="section-number-2">3</span> Вставка имени ветки в сообщение коммита</h2>
<div class="outline-text-2" id="text-3">
<p>
Всякие ЖИРО-образные системы любят, чтобы в сообщении коммита
писались имена задач, чтобы их можно было вставлять в историю
задач. И чтобы еще и ветки так же назывались. 
По жиротрадиции, это что-то вроде FOO-1337.
</p>
<div class="org-src-container">
<pre class="src src-shell" id="orgbd0da84"><span style="color: #8B8989; font-style: italic;">#</span><span style="color: #8B8989; font-style: italic;">!/bin/</span><span style="color: #4c83ff;">bash</span><span style="color: #8B8989; font-style: italic;"> </span>
<span style="color: #ff69b4;">BRANCH_NAME</span>=$(<span style="color: #fa8072;">git</span> rev-parse --abbrev-ref HEAD | grep <span style="color: #61CE3C;">"[[:upper:]].*-[[:digit:]].*"</span>)
<span style="color: #4c83ff;">echo</span> <span style="color: #61CE3C;">"$BRANCH_NAME"</span> &gt;&gt; $<span style="color: #ff69b4;">1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga135ada" class="outline-2">
<h2 id="orga135ada"><span class="section-number-2">4</span> Настройка и добавление хуков в репы</h2>
<div class="outline-text-2" id="text-4">
<p>
При работе с литературным исходником можно выполнить настройку и
сборку непосредственно из самого Emacs. Подробнее &#x2013; в литературном
исходнике. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Roman Zayrullin</p>
<p class="date">Created: 2017-11-30 Чт 19:23</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
